tutorials/fluids/cylinderInChannel/Allrun
#!/bin/bash

# Source tutorial clean functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

solids4Foam::caseOnlyRunsWithFoamExtend

# Create the mesh
runApplication fluentMeshToFoam cylinderInChannel.msh
runApplication changeDictionary

# Run the solver
runApplication solids4Foam
